firt_routes/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "tifagoddess"], ["image_url", "tifa.com"], ["artist_id", 4], ["created_at", "2021-02-04 22:24:09.077103"], ["updated_at", "2021-02-04 22:24:09.077103"]]
---
    def create
        # binding.pry
        artwork = Artwork.new(strong_params)
        if artwork.save