firt_routes/app/controllers/users_controller.rb

    def index
        lists = User.all
---
SELECT "users".* FROM "users"

    def create
        # binding.pry
        user = User.new(strong_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Eren Jager"], ["email", "titankiller@email.com"], ["created_at", "2021-02-03 22:37:03.070441"], ["updated_at", "2021-02-03 22:37:03.070441"]]

    def show
        person = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        person = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def destroy
        person = User.find(params[:id])
        person.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]